Revit 2027 API
Element.GetExternalFileReference Method
 Gets information pertaining to the external file referenced by the element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ExternalFileReference GetExternalFileReference()
Public Function GetExternalFileReference As ExternalFileReference
public:
ExternalFileReference^ GetExternalFileReference()
member GetExternalFileReference : unit -> ExternalFileReference
Return Value
ExternalFileReference
 An object containing path and type information for the external file referenced by the element.
Exceptions
Exception | Condition
InvalidOperationException |  This Element does not represent an external file.
See Also
Reference
Element Class
Autodesk.Revit.DB Namespace